In [1]:
import pandas as pd
import numpy as np

# basic datatypes of pandas:
    1. series
    2. dataframe

creating series:

In [2]:
s = pd.Series([1, 2, 3, np.nan, 6, 7])

In [3]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    6.0
5    7.0
dtype: float64

creating DataFrame

In [4]:
dates = pd.date_range('2002-05-05', periods=6,)

In [5]:
dates

DatetimeIndex(['2002-05-05', '2002-05-06', '2002-05-07', '2002-05-08',
               '2002-05-09', '2002-05-10'],
              dtype='datetime64[ns]', freq='D')

In [8]:
dataset = pd.DataFrame(np.random.randn(6, 4) , index= dates, columns= list('ABCD'))

In [9]:
dataset

                   A         B         C         D
2002-05-05 -0.248035 -0.789981  0.050096  0.226938
2002-05-06  1.868646  1.116873  2.090270  0.983982
2002-05-07  0.767246 -0.654540 -0.111086  0.752673
2002-05-08 -0.994385  0.559117  0.389748 -1.748783
2002-05-09 -0.164367  2.571907  0.443770  0.218333
2002-05-10  0.644833 -2.424382 -0.432361  0.338548

Creating DataFrame from Dictionary

In [12]:
df = pd.DataFrame(
    {
        'A':1.0,
        'B':pd.Timestamp('20020505'),
        'C':pd.Series(1, index=list(range(4)), dtype='float32'),
        'D':np.array([3] * 4, dtype='int32'),
        'E':pd.Categorical(['test', 'train', 'test', 'train']),
        'F':'FOO'
    }
)

In [13]:
df

     A          B    C  D      E    F
0  1.0 2002-05-05  1.0  3   test  FOO
1  1.0 2002-05-05  1.0  3  train  FOO
2  1.0 2002-05-05  1.0  3   test  FOO
3  1.0 2002-05-05  1.0  3  train  FOO

All column having different datatype in dataframe .
but in series all element having different datatype

In [14]:
df.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [15]:
df.A

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [16]:
df.abs

<bound method NDFrame.abs of      A          B    C  D      E    F
0  1.0 2002-05-05  1.0  3   test  FOO
1  1.0 2002-05-05  1.0  3  train  FOO
2  1.0 2002-05-05  1.0  3   test  FOO
3  1.0 2002-05-05  1.0  3  train  FOO>

In [23]:
df.A.add(1)

0    2.0
1    2.0
2    2.0
3    2.0
Name: A, dtype: float64

In [20]:
df.add_prefix(1)

    1A         1B   1C  1D     1E   1F
0  1.0 2002-05-05  1.0   3   test  FOO
1  1.0 2002-05-05  1.0   3  train  FOO
2  1.0 2002-05-05  1.0   3   test  FOO
3  1.0 2002-05-05  1.0   3  train  FOO

In [25]:
df.add_suffix(1)

    A1         B1   C1  D1     E1   F1
0  1.0 2002-05-05  1.0   3   test  FOO
1  1.0 2002-05-05  1.0   3  train  FOO
2  1.0 2002-05-05  1.0   3   test  FOO
3  1.0 2002-05-05  1.0   3  train  FOO

Try This also:

df.A                  df.bool
df.abs                df.boxplot
df.add                df.C
df.add_prefix         df.clip
df.add_suffix         df.columns
df.align              df.copy
df.all                df.count
df.any                df.combine
df.append             df.D
df.apply              df.describe
df.applymap           df.diff
df.B                  df.duplicated

Viewing data

In [30]:
df

     A          B    C  D      E    F
0  1.0 2002-05-05  1.0  3   test  FOO
1  1.0 2002-05-05  1.0  3  train  FOO
2  1.0 2002-05-05  1.0  3   test  FOO
3  1.0 2002-05-05  1.0  3  train  FOO

In [31]:
df.head(2)

     A          B    C  D      E    F
0  1.0 2002-05-05  1.0  3   test  FOO
1  1.0 2002-05-05  1.0  3  train  FOO

In [32]:
df.tail(2)

     A          B    C  D      E    F
2  1.0 2002-05-05  1.0  3   test  FOO
3  1.0 2002-05-05  1.0  3  train  FOO

In [33]:
df.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [34]:
df.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [36]:
# Numpy representation
dataset.to_numpy()

array([[-0.24803527, -0.78998148,  0.05009632,  0.22693751],
       [ 1.86864596,  1.11687304,  2.09026978,  0.98398216],
       [ 0.76724616, -0.65453955, -0.11108586,  0.75267279],
       [-0.99438453,  0.55911721,  0.38974837, -1.74878263],
       [-0.16436698,  2.57190694,  0.44376955,  0.21833275],
       [ 0.64483292, -2.4243816 , -0.43236148,  0.33854776]])

statistic summary

In [37]:
dataset.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.312323  0.063166  0.405073  0.128615
std    0.998837  1.736715  0.887169  0.970310
min   -0.994385 -2.424382 -0.432361 -1.748783
25%   -0.227118 -0.756121 -0.070790  0.220484
50%    0.240233 -0.047711  0.219922  0.282743
75%    0.736643  0.977434  0.430264  0.649142
max    1.868646  2.571907  2.090270  0.983982

In [38]:
df.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [42]:
dataset.sort_index(axis=1, ascending=False)

                   D         C         B         A
2002-05-05  0.226938  0.050096 -0.789981 -0.248035
2002-05-06  0.983982  2.090270  1.116873  1.868646
2002-05-07  0.752673 -0.111086 -0.654540  0.767246
2002-05-08 -1.748783  0.389748  0.559117 -0.994385
2002-05-09  0.218333  0.443770  2.571907 -0.164367
2002-05-10  0.338548 -0.432361 -2.424382  0.644833

In [43]:
dataset.sort_values(by='B')

                   A         B         C         D
2002-05-10  0.644833 -2.424382 -0.432361  0.338548
2002-05-05 -0.248035 -0.789981  0.050096  0.226938
2002-05-07  0.767246 -0.654540 -0.111086  0.752673
2002-05-08 -0.994385  0.559117  0.389748 -1.748783
2002-05-06  1.868646  1.116873  2.090270  0.983982
2002-05-09 -0.164367  2.571907  0.443770  0.218333

In [49]:
dataset.loc()